# **Итоговая проверочная работа**
### *Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше, или равна трём символам. Первоначальный массив может быть введен с клавиатуры, или задан на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись массивами.*

## Описание логики программной части C# проекта.

Исполняемую программу можно разделить на 3 основных этапа:

1. Создание исходного массива строк. 

    На этом этапе происходят следующие операции:
    * Очистка консоли для более комфортного отображения вводимой пользователем информации и итогового вывода информации в консоль.
    * Приглашение пользователя ко вводу информации сообщением: 
    
     *Введите элементы массива через пробел:*
    * Сохранение введенной информации в переменную со строковым типом данных.
    ```
    Console.Clear();

    string s = string.Empty;

    while (String.IsNullOrEmpty(s))
    {
        Console.WriteLine("Введите элементы массива через пробел:");
        s = Console.ReadLine();
    }
    string[] inputArray = s.Split(' ');
    ```
    Приглашение пользователя ко вводу и сохранение введённой информации в строковую переменную реализовано внутри цикла _while_, в условии которого проверяется истинность результата работы метода проверки исключений _String.IsNullOrEmpty_.
    * Преобразование строки в одномерный массив строк.


1. Создание массива, элементы которого будут отвечать условию задачи (длина         отдельной строки <= 3 символам).

    На данном этапе происходит применение специализированного метода (__string[] CreateShortArray(string[] array)__), принимающего исходный массив строк как аргумент и возвращающий массив строк, отвечающих условию задачи. Возвращённые методом данные записываются в новый строчный массив.  Более подробное описание логики метода смотри в приложении 1.

    ```
    string[] newArray = CreateShortArray(inputArray);
    ```

1. Вывод информации в консоль.
    
    На данном этапе происходят следующие операции:
    * Вывод в консоль сообщения, поясняющего дальнейший вывод в консоль массивов строк для сравнения.

        Сообщение: Вывод: [Введенный пользователем первичный массив] -> [Массив полученный после преобразования первичного массива]
    * Поочередное применение специализированного метода для выведения массива в консоль (__void PrintArray(string[] array)__) к исходному массиву и к массиву, элемениы которого отвечают условию задачи. Между применением методов к массивам находится операция вывода на экран символа-разделителя (->) для более эстетичного отображения информации. Более подробное описание логики метода смотри в приложении 2.

    ```
    Console.WriteLine("Вывод: [Введенный пользователем первичный массив] -> [Массив полученный после преобразования первичного массива]");
    PrintArray(inputArray);
    Console.Write(" -> ");
    PrintArray(newArray);  
    ```

## **ПРИЛОЖЕНИЕ 1**
Описание логики метода создания массива, элементы которого отвечают условию задачи (длина строки <= 3 символам).
```
string[] CreateShortArray(string[] array)
{
    string[] result = new string[1];
    for (int i = 0, j = 0; i < array.Length; i++)
    {
        if (array[i].Length <= 3)
        {
            result[j] = array[i];
            if (i != array.Length - 1)
            {
                Array.Resize(ref result, result.Length + 1);
                j++;
            }
        }
    }
    return result;
}
```
Метод принимает в качестве аргумента одномерный массив элементнов с типом данных *string*. Возвращаемыми данными так же является одномерный массив элементнов с типом данных *string*.

В теле метода присутствуют следующие операции:
* Инициализация массива строк result c параметром Lenght = 1.
* Цикл for проверяющий все элементы массива - аргумента на соответствие условию задачи. (Помимо счётчика i для перехода между элементами массива - аргумента, иницирован счетчик j, нужный для перехода внутри массива result).
* Вложенное в цикл ветвление в условии которого проверяется соответствие i элемента массива - аргумента условию задачи (i != array.Length - 1)

    В случае соответствия элемента условию выполняется операция присвоения j элементу массива result значения i элемента массива - аргумента.
    
    Далее выполняется вложенное ветвление в условии которого проверяется индекс текущего проверенного элемента, если проверялся не последний элемент массива, то выполняется инкрементирование длины массива result и счетчка j.
* После окончания выполнения цикла происходит возвращение массива result.

## **ПРИЛОЖЕНИЕ 2**

Описание логики метода вывода элементов массива в консоль.

Метод принимает в качестве аргумента одномерный массив элементнов с типом данных *string*. Метод не возвращает данных - void метод.
```
void PrintArray(string[] array)
{
    Console.Write('[');
    for (int i = 0; i < array.Length; i++)
    {
        Console.Write('"');
        Console.Write($"{array[i]}");
        Console.Write('"');
        if (i != array.Length - 1)
        {
            Console.Write(", ");
        }
    }
    Console.Write(']');
}
```
В теле метода присутствуют следующие операции:
* Вывод символа '[' - он является частью маски для визуальной эстетичности вывода жлементов.
* Цикл for поочередно выводящий в консоль все элементы массива, обрамленные двойными ковычками (дополнительное визуальное сопровождение элементов, элементы берутся в ковычки так как вывод будет организован в формате массива строк).

    В цикле присутствует вложенное ветвление в условии которого проверяется текущий элемент, если он не последний в массиве, то после него в консоль выводится запятая и пробел ", ".
* После окончания выполнения цикла происходит вывод символа ']' - закрывающего маску оформления.









